(-- Start position X0 Y0 Z0 --)

#1 = 3.2    (total depth Z)
#2 = 0.100  (depth Z per cycle, should be multiply to #1)
#3 = 120    (trimming feed)
#4 = 20     (drilling feed)


G21         (mm)
G91         (switch to incremental coordinates)

G17         (use plane XY)

G0 Z2  F300
M3 S8000    (turn on spindle)
G1 Z-2 F#4

M98 P1000 L[[#1 / #2] / 2]  (call sub-program few times)
G0 Z#1 F300                 (restore Z to value before call sub-program)

G90         (switch to absolute coordinates)

M30         (turn off spindle)


; під-програма
O1000

; Врізка
G1 Z[0 - #2] F#4

; Дуга 45° проти годинникової стрілки
; X-6.74 Y16.26 — кінцева точка дуги (відносно поточної позиції).
; I-23 J0 — центр дуги знаходиться на 23 одиниці ліворуч від поточної позиції.
G3 X-6.74 Y16.26 I-23 J0 F#3

; Врізка
G1 Z[0 - #2] F#4

; Дуга 45° за годинниковою стрілкою, повернення в початковий (0, 0)
G2 X6.74 Y-16.26 I-16.26 J-16.26 F#3

; Під'єм на 1 крок
G1 Z#2 F#3

G1 Y23 F#3

; Врізка
G1 Z[0 - #2] F#4

G1 Y-23 F#3

; Під'єм на 1 крок
G1 Z#2 F#3

G1 X25.937 Y1.814 F#3

; Врізка
G1 Z[0 - #2] F#4

G1 X-25.937 Y-1.814 F#3

; Під'єм на 1 крок
G1 Z#2 F#3

G1 X0 Y2.5 F#3
; Дуга 90° за годинниковою стрілкою
G2 X2.5 Y-2.5 I0 J-2.5 F#3

; Врізка
G1 Z[0 - #2] F#4

; Дуга 90° проти годинникової стрілки
G3 X-2.5 Y2.5 I-2.5 J0 F#3
; Повернення на початок координат
G1 X0 Y-2.5 F#3

; Під'єм на 1 крок
G1 Z#2 F#3

G1 X0 Y5  F#3
; Дуга 90° за годинниковою стрілкою
G2 X5 Y-5 I0 J-5 F#3

; Врізка
G1 Z[0 - #2] F#4

; Дуга 90° проти годинникової стрілки
G3 X-5 Y5 I-5 J0 F#3
; Повернення на початок координат
G1 X0 Y-5 F#3

; Повернення з під-програми
M99
